'''
Запросить у пользователя радиус окружности. 
Вычислить длину окружности и площадь круга. 
Вывести результаты на консоль.
'''

r = int(input())
print(2 * 3.14 * r, 3.14 * r * r)
