
'''
Вывести текущее время крупными символами 
в стиле ЖК-индикатора, используя
символы псевдографики.
'''

import datetime

alphabet = {
	0: ''' ■■■ ■   ■■  ■■■ ■ ■■■  ■■   ■ ■■■ ''',
	1: '''  ■   ■■    ■    ■    ■    ■  ■■■■■''',
	2: ''' ■■■ ■   ■    ■   ■   ■   ■   ■■■■■''',
	3: '''■■■■■   ■   ■     ■     ■■   ■ ■■■ ''',
	4: '''   ■   ■■  ■ ■ ■  ■ ■■■■■   ■    ■ ''',
	5: '''■■■■■■    ■■■■     ■    ■■   ■ ■■■ ''',
	6: '''  ■■  ■   ■    ■■■■ ■   ■■   ■ ■■■ ''',
	7: '''■■■■■    ■   ■   ■   ■    ■    ■   ''',
	8: ''' ■■■ ■   ■■   ■ ■■■ ■   ■■   ■ ■■■ ''',
	9: ''' ■■■ ■   ■■   ■ ■■■■    ■    ■ ■■■ ''',
	':': '''      ■■   ■■        ■■   ■■     ''',

}

time = datetime.datetime.now().strftime("%H%M")

for i in range(7):
	print(

		f"{alphabet[int(time[0])][i*5:i*5+5]:5s} " 
		f"{alphabet[int(time[1])][i*5:i*5+5]:5s} "
		f"{alphabet[':'][i*5:i*5+5]:5s} "
		f"{alphabet[int(time[2])][i*5:i*5+5]:5s} "
		f"{alphabet[int(time[3])][i*5:i*5+5]:5s}"

	)
